***PANDAS TUTORIAL FOR CONCATINATION OF DATAFRAMES***

In [1]:
import pandas as pd

In [3]:
pak_weather = {
    "city":["Lahore","Karachi","Skardu"],
    "temperature":[35,45,20],
    "wind":[15,12,39]
}

In [21]:
pak=pd.DataFrame(pak_weather)
pak

      city  temperature  wind
0   Lahore           35    15
1  Karachi           45    12
2   Skardu           20    39

In [5]:
ind_weather = {
    "city":["Amritsar","Mumbai","Chandigarh"],
    "temperature":[25,15,40],
    "wind":[25,12,49]
}
ind=pd.DataFrame(ind_weather)
ind

         city  temperature  wind
0    Amritsar           25    25
1      Mumbai           15    12
2  Chandigarh           40    49

In [18]:
indopak=pd.concat([pak,ind], ignore_index=True)
indopak

         city  temperature  wind
0      Lahore           35    15
1     Karachi           45    12
2      Skardu           20    39
3    Amritsar           25    25
4      Mumbai           15    12
5  Chandigarh           40    49

In [15]:
s=pd.Series(["Sunny","Rain","Snow","Rain","Sunny","Sunny"], name="Event")
s

0    Sunny
1     Rain
2     Snow
3     Rain
4    Sunny
5    Sunny
Name: Event, dtype: object

In [19]:
indopak

         city  temperature  wind
0      Lahore           35    15
1     Karachi           45    12
2      Skardu           20    39
3    Amritsar           25    25
4      Mumbai           15    12
5  Chandigarh           40    49

In [20]:
df=pd.concat([indopak,s], axis=1)
df

         city  temperature  wind  Event
0      Lahore           35    15  Sunny
1     Karachi           45    12   Rain
2      Skardu           20    39   Snow
3    Amritsar           25    25   Rain
4      Mumbai           15    12  Sunny
5  Chandigarh           40    49  Sunny